SoapRequestSamples/SellerProfileRequestSample.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<m:SellerProfileSearchRequest xmlns:m="urn:PI/DevCentral/SoapService">
			<SellerProfileSearchRequest xsi:type="m:SellerProfileRequest">
				<seller_id xsi:type="xsd:string">ARZ6W4AEZ5FQH</seller_id>
				<tag xsi:type="xsd:string">webservices-20</tag>
				<type xsi:type="xsd:string">lite</type>
				<devtag xsi:type="xsd:string">your-dev-tag</devtag>
				<page xsi:type="xsd:string">1</page>
			</SellerProfileSearchRequest>
		</m:SellerProfileSearchRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
